{"podcast_details": {"podcast_title": "a16z Podcast", "episode_title": "Wartime vs Peacetime: Ben Horowitz on Leadership", "episode_image": "https://image.simplecastcdn.com/images/38c671cb-f233-4f8b-884e-e3c7bd47db16/6deeb595-a193-49cd-935a-29e8ba5d9784/3000x3000/the-future-podcast-fa.jpg?aid=rss_feed", "episode_transcript": " Culture is not a set of beliefs. This is so key, it's a set of actions. And Ben says, you owe 20 bucks. Okay, so I reach into my wallet, and you know, the norm was you put the cash on the table. So I reach into my wallet and I pull out and I unfortunately only had $100. And I kind of pull it out and Ben sees it and he's like, we don't make change, motherfucker. If you show up five minutes late, 10 minutes late, then you can say you have respect for what it means to build a company, but you don't really have respect for what it means to build a company. Because you wouldn't do that if you did. You know what? It's better to be right than consistent. Hello everyone and welcome back to the A16Z Podcast. This is your host Steph Smith, and today we've got quite the treat for you. You'll get to hear some exclusive audio from our Bio and Health Build Conference. And you'll hear directly from A16Z co-founder Ben Horowitz in conversation with Bio and Health GP Jorge Conte. They'll talk about everything from the inspiration behind Ben's book, The Hard Thing About Hard Things, which by the way includes a wonderful story about how the open internet was secured and how that wasn't always given. You'll also get to hear about some surprising leaders from history, the differences between wartime and peacetime CEOs, what building culture really means, and since this was run by our Bio and Health team, you'll also get to hear what the differences are between bio and healthcare innovation versus other kinds of technology. I think you're really going to enjoy this episode. As a reminder, the content here is for informational purposes only, should not be taken as legal, business, tax, or investment advice, or be used to evaluate any investment or security, and is not directed at any investors or potential investors in any A16Z fund. Please note that A16Z and its affiliates may also maintain investments in the companies discussed in this podcast. For more details, including a link to our investments, please see a16z.com slash disclosures. Morning. Beautiful day today. So obviously, you know, Ben really doesn't need much of an introduction, but I will... Yeah, they have Google. But you've done everything, right? You've been the founder of companies, you've been a CEO, venture capitalist, best-selling author. You know, one of the things that to me is incredible is as I go and visit founders, companies that we're fortunate to be investors in, more often than not, I see a copy of The Hard Thing about Hard Things or... Yeah, when things go bad, it's my time. And I will tell you, on a personal note, I picked up The Hard Thing about Hard Things when I was a founder, when I was a CEO. I was about seven years into the struggle, the capitalist struggle, as you call it. Yeah, struggle can last a long time. Yeah, man, it was painful. For me, it was a hard read. You know, I will say, like, that book, it wasn't even a book for me, it was like an intervention. I needed it, you said the things that I was feeling that I couldn't articulate. So thank you. Thank you for writing it. Yeah, that was a lot of the book was, you know, the things that everybody was feeling and nobody was willing to talk about. Was it hard to write? It was embarrassing. Was it hard to write or did it sort of flow out of you at some point? No, no, no, no. I was just like so mad about how building a company was being described that it was easy to write. You know, when you write in a fit of rage, it's easy. It's inspired writing. Yes, inspired writing. So let's talk a little bit about, you know, sort of the underlying, fire behind writing that book. What would you say are some of the biggest or most important lessons that you learned along the way in terms of being a founder, a CEO, a leader? Yeah, so it's interesting. I was thinking about this. The biggest lesson is actually, and I'll spend some time on this because it's a counter lesson to, I think, today's conventional wisdom. So, you know, like one of the things that most people no longer agree with that kind of once is this whole like great person of history theory, where like history is moved by certain people doing certain things and it's kind of been replaced with these, you know, there are these big cultural forces that move it. And then there was a speech Obama gave a few years back or maybe 10 years back now where he said, you know, it's like, you didn't build that, you know, and there's truth in both of them, which is, well, yeah, you can't build a company by yourself. And yeah, like there are cultural forces. But I think that neither is quite true in that if you've kind of built companies, what you realize is there's a lot of people who you can replace. And then there's a few people who if they go, that's it. It's game over. That's end of the company. And that's quite often the founder. And let me give you kind of like a couple of stories on how an individual effort in a moment in time kind of changes the outcome for the world. So when we were at Netscape and a lot of people don't remember this anymore, but the Internet was not a fait accompli. Like the Internet wasn't like automatic. It was going to happen regardless. That's not true at all. In fact, if you go back and if you can get your hands on the first edition of Bill Gates's book, The Road Ahead, which was published in 1995, right? Many years after, like the Mosaic browser and all that, it's a book about the future and it doesn't mention the word Internet. Not one time. He refers to something else, which was called the information super highway, which was something that he was trying to build. Larry Ellison was trying to build in a proprietary way. And it was very competitive kind of at the time and, you know, early 95. And most people and most of the press and most of the kind of people in the world thought the Internet wouldn't make it because it was a weird academic network. You know, it was a bunch of professors on it. And most of all, it had no security. And everybody knew then that you couldn't put security into a protocol after the fact, particularly if it was widely deployed. What are you talking about? It's never going to work. And so, you know, Bill Gates was going to own the Internet in a proprietary way, much the way like Facebook owns social networking or that kind of thing. And I remember it clearly because, you know, we had this guy at Netscape by the name of Kip Hickman. And there was this legend behind him, which I knew very well because I was at Silicon Graphics with him, you know, years before. And Jim Clark, who was our kind of like very excitable founder, we couldn't get the kind of operating system to work on the SGI machine on the new multiprocessor machine. And Jim kept hiring and firing engineers, including like Steve Bourne, who invented the Bourne shell, you know, for those of you who are Unix heads. And he fired Steve Bourne. He's like, no, he couldn't get it to work. And Kip Hickman got it to work. And so Kip Hickman's at Silicon Graphics and Jim Clark says to him, Kip, you have to secure the Internet, just like that. Like that was the, you have to secure the Internet. And Kip came back in three months with SSL, like SPECT, implemented in the product. And that changed it. And that was like basically the start of the Internet beating the Microsoft proprietary network. If Microsoft had won, Nathan Murwald had already said, we're going to take a vigourish, which is a kind of mafia term, basically a cut of every transaction on the Internet. And you go, well, that would have been a very different world. And we've actually seen that play out, right? Like the smartphone could have been open, but like nobody stepped up to that degree on the open thing. And we do pay a 30% tax on every single application we get on the smartphone. You mean through like through the Apple Store? Yeah, through the Apple Store. So things can really change. And, you know, so yeah, Elon Musk, you know, he didn't start Tesla and he couldn't build it with all those people. But like if he hadn't like been so crazy and raised all that money and so forth and taken on Ford and GM, which was like the most psycho thing you could ever do, like how much longer for electric cars would have been, you know, 10 years, 20 years. And so, you know, a lot of the biggest lesson that I have is if in that moment the founder or the person doesn't step up, then the world is different. And look, for everybody here who's a founder, if you don't fix the health care system, if you don't kind of produce that drug, like maybe somebody will do it in the future, but how many people are going to die in the meanwhile? And, you know, the world really does change on individual efforts. And that's probably the biggest reason, you know, I wanted to start the firm was just to get that message out. That's remarkable. And it is incredible that you can pick sort of specific examples of where a founder did change the world. And that's a great lesson. Speaking of great founders, you make a lot of historical references in your work. You know, who's a surprising leader in history that you would highlight to folks here? And are there any sort of unique lessons that we can draw from an unsuspecting figure, if you will? Yeah, so the one that I've probably written the most about is to Sam Loewicher, who was the founder of the Haitian Revolution, which is the only successful slave revolt in human history. I don't know if there's other species that have slaves. But, you know, he was really remarkable in that he was born a slave, but the kind of very special thing that he figured out, and he's very like a super smart guy. I mean, part of the reason he got into that position is he was so smart that the guy running the plantation was like, well, you're smarter than everybody else here. I'm just going to let you run it. You know, Loew kind of take over, and he became the guy's driver. And so he would go into town and meet all the various Europeans who were kind of fighting over the island at the time. And he basically learned European culture. And by understanding all the things in European culture and then all the things in slave culture, he was able to take, you know, a culture that nobody had been able to create a military out of, because slave culture is very difficult, military culture because it's a very low trust environment. And in the military, of course, you have to be able to trust the orders in order to get anything done. And so Toussaint was able to merge the two. And by doing that, he ended up building like this massive army and defeating the British and the French and the Spanish on the island and taking the whole thing. And it ended up actually being his downfall, very ironically in that because he incorporated, you know, in doing it, he would incorporate Europeans into his army to kind of create this hybrid culture. And that's how his enemies unhooked him at the end and turn him over to Napoleon. And that was the end of Toussaint. And they kind of ended that culture, which was a very advanced culture. So when Toussaint was running Haiti, they actually had more export income than the United States. So he had built like a pretty amazing economy and so forth. But oh well, it didn't work out in the end. But like I said, unbelievable story of how you build an organization out of, you know, kind of elements that people might not think would work. So I want to, of course, come back and touch on culture, because one of the things that's been remarkable is over the course of this event, the importance of culture has come up on various panels. So I want to make sure we get back to that. But before we shift to culture, you're talking about the army in Haiti. So you've written a lot about wartime and peacetime, the wartime CEO and the peacetime CEO. So, number one, for folks that may have not seen your words on that, you define what you mean by that. And then, of course, the obvious follow up question is, are we in wartime now? Are we? Which I assume the answer is probably. And if so, you know, how should CEOs, founders be thinking about that? Yeah, I had a rap quote on that post, which I think describes it well, which is you're lucky that I ain't the president because I'd push the fucking button, get it over with, fuck all that waiting and procrastinating and all that goddamn negotiating. And that's kind of like the mentality of the wartime CEO. Like, we're just going, we're done talking. Kind of the best way to think about it is imagine like you're building like a peacetime army to fight the Cold War against the Soviet Union. And, you know, you've got a profile for like what a soldier should look like and who should be a general. And you've got OKRs and KPIs and, you know, and a strategy for fighting the Cold War and all the kinds of things, the kinds of weapons you need to build and all this stuff. And then one day you wake up and you're fighting ISIS. And like how much of that old stuff is right? Maybe none of it. How much of those old people are going to be the people who can actually fight ISIS? Not all of them. But you know that. And nobody else knows that. And so how do you get the army from there to here? I mean, that's a little bit kind of what happens in these big macroeconomic turns, right? You set up this whole thing for this high growth environment. And then all of a sudden it's not a high growth environment. But the team is still on the old strategy, the old KPIs, the old OKRs, the old organizational design. And how do you get them over there fast? And so a lot of what wartime is, is like, how do you get the team very fast from the old plan to the new plan? And it's not your old process. We're not going to go like, you know, it tends to be like, no, we're not doing that. We're doing this. Well, but you said last week, you know what? It's better to be right than consistent. So whatever I said last week, don't believe it. It's no longer true. It's over. And you have to be willing to do that, to be kind of wartime. And in a time like this, it becomes very essential because every day you delay could cost you the company. But to make that shift into like a wartime footing, two things have to be true, right? You have to recognize that you're at war and then you have to be able to make the tough decisions. So I think that most people, like in my experience, most people recognize it and they freeze. And they freeze. Because there's two things that people don't want to do that are necessary in wartime. One, they don't want to be inconsistent. And that's very dangerous. And then the second thing they don't want to do is not listen to their team. And I know that sounds funny. Well, what do you mean, Ben? You're saying we shouldn't listen to our teams? Yes. You can't listen to your team because they're on the old plan and the old structure with the old idea. And so you have to, for that period, until they reset, you've got to dictate and go, no, no, we're not doing that. And then they'll start using your cultural ideas against you. So let's talk about culture. Let's talk about your words. How do you define culture? You know, I think people have like a feeling of what culture is, but it's a hard thing to define. So help us define culture when you mean by it. Yeah. So I love the samurai from a cultural design standpoint, cultural implementation standpoint. It's an amazing thing in that if you go to Japan today, like it's laden with samurai culture, like how did they build a culture that lasted so long? And one of their core ideas is a culture is not a set of beliefs. This is so key. It's a set of actions. And I think when you talk about culture, that's like where you have to start. Culture is all the behaviors that you have, how you treat each other. You know, like somebody sends you an email, do you get back to them, you know, in an hour, in a day, in a week, in a month, in three months. But, you know, like that's a cultural idea. You know, do you stay at the Four Seasons or at the Red Roof Inn when you traveled? Like all these things are cultural. When you work with partners, do you actually care about their outcome or not? Like all these things are part of your culture. And your culture ends up kind of defining a lot more of how the organization works than your mission statement or your KPIs or any of that other stuff, because it's like daily how you're behaving. You know, every micro decision that everybody makes is kind of a reflection of the culture. Do you come to a meeting on time? Like, does that matter? Companies that aren't on time to meetings, like meetings start like 20, 30 minutes late, like consistently. And whoever shows up on time is just like sitting there on their laptop, whatever. But that's all like behavioral. It's not a belief. And, you know, people are trying to find things in terms of these beliefs, but they don't mean anything. It's like integrity. We're a culture of integrity. Well, OK, so let's get specific. So if it comes down to the integrity with your investors promising to make your plan or the integrity with the employee promising that like it's going to be a great outcome or the integrity with your customer on the deal, like which one gets compromised if they come into conflict? That's the real thing. Integrity like it's pie in the sky. Most companies define their culture in this pie in the sky concepts that can be interpreted however you want. But it's not the idea. It's the behaviors. And so you really have to define things in terms of like, how are we going to behave in a certain situation? And so like we have many things like this. So like you're late for a meeting with an entrepreneur. That's a real fucking problem. Like, that's the behavior. It's that, you know, and it's underneath the guys of first class. Business first class boy. But what does it mean? And so, you know, one of the things we believe in, we believe in like we're not dream killers. We're dream supporters. What does that mean? Well, if you get on Twitter and say an entrepreneur's idea is stupid, you're fired. Like, that's what it means. And doesn't have to be like any entrepreneur because we're like dream builders. We believe anybody who has a dream. We're for that. I don't care if we think it's a good idea or not. We're for that. And that's our culture. But there's got to be a behavior that goes with it. You see what I'm saying? Otherwise, like people will misinterpret it. They'll reinterpret it. You know, they'll weaponize it against you. You know, when you talk about culture, you're talking about how are we going to behave? How do we show up every day? How do we treat each other? What is it like to interact with us? Are people better off or worse off for, you know, doing business with us? These are the things you have to ask yourself. And that's what it ends up meaning. And it's really important. But people, because it's so weird and abstract, people don't pay enough attention to it often. Yeah. And I think that focus on what you do is what defines the culture. What you do is who you are. People misinterpreted that title a lot, by the way. I'm not a salesman. It's like, I just want to be a man. Well, you know, the firm famously in the early days would charge if you were late to meeting with an entrepreneur, right? Yeah, $10 a minute. $10 a minute. And there was a... I got like $3,000 off Andreessen on that. Well, I remember I was once late by a series of very unfortunate and unforeseen circumstances. I was two minutes late to an entrepreneur meeting and I walk in and Ben says, you owe 20 bucks. OK, so I reach into my wallet and, you know, the norm was you put the cash on the table. So I reach into my wallet and I pull out and I unfortunately only had $100. And I kind of pull it out and Ben sees it and he's like, we don't make change, motherfucker. So those two minutes cost me 100 bucks. Never late again. You learned your lesson. Yeah, I was never late again. Also, I carry small bills. Very good. But that's really important in that putting like your cultural values in your like annual review, it's got to be something you hit daily. Right. Like you have to be reminded of it constantly. And look, that one, like, why aren't you late? The big thing is, well, why can't you be late? Well, because it's really hard to build a company. And if you show up five minutes late, 10 minutes late, then you can say you have respect for what it means to build a company, but you don't really have respect for what it means to build a company because you wouldn't do that if you did. And so everybody has to know that. And if everybody in a venture capital firm doesn't know that on a daily basis, then they'll lose that because the other behavior is I have the money. You need the money. You show up to me to get the money. I decide if you want the money. I feel like the big person. You know, you're the small person like that can seep into a venture capital firm really easy. So you need a daily behavior to go. No, we're not doing that. No, we're not doing that. We're going to be on time. We're going to get back to people. We're going to if we don't invest, we're going to let them know why. Like all those things, all those behaviors counter program this natural kind of dynamic that can make you somebody you don't want to be. And so when you talk about culture, that's what you really talk about. You said something to me a long time ago that stuck with me and it was around communication for as companies scale. I think you told me like after 50 people, the systems that you had to communicate with 50 break down and you got to have a new system. Does culture scale? It's hard to scale. Right. So look, you don't even have to write it down or say anything if it's the first 10 of you because you know, like you get along, you do stuff. Somebody does something like they'll feel bad because they're not part of the group. You know, you want to be part of the group, all that. But like if you're a thousand people, like there are many subgroups and then worse yet, you hire people from another company. So you, you know, you could hire people from Novartis or you could hire people from Merck or wherever. And they're going to come with that culture. And, you know, like, oh, we got into this vein of Google engineers, you know, who can do AI stuff and we hired eight of them. Well, those eight people by default are going to behave exactly the way they did at Google unless you force them to assimilate into your culture. And so a really important thing is like mandatory cultural assimilation in a company is very important. And not to say there won't be kind of subculture variations within, you know, like sales might be different than engineering in many ways and that kind of thing. But there are certain things, certain tenants, certain parts of the culture that you can't compromise on. And again, if you do, it'll slip away very fast. And so that's why, like, you need the daily reminders. You need something that people go, oh, I can't do that. All right, I'm going to, you know, play it your way. Can you change culture? Absolutely. And so we talked about Toussaint before. To me, his greatest accomplishment was changing the low trust culture that he had into like a super high trust culture. And he did a number of things to do it. And it really paid off. So like one of the things he did is he made a rule like if you're an officer in the army, you can't cheat on your wife. And you go like, OK, that's like weird. Why did he make that a rule? It was a very mercenary war in Haiti at the time or what's now called Haiti. And so it was almost like salary was like pillaging and raping all these kinds of things. And he was like, no, any commitment you make, like I got to trust that you're going to keep the commitment. And so you may think that's OK, but you made a commitment to your wife. You have to keep that or I can't trust you. And like that started the culture. And it's really interesting and how it helped him win the war because what happened was they were famous actually. So, you know, like I said, you had four armies, the slave army, the British, the Spanish, the French and Toussaint's army was known for they didn't have clothes. Have it done right. So these other guys are like they're in their badges. They're running through pillaging, raping the slave army into any of that because of that behavior. They actually got the support of the white women on the island, protected the slave army, hit them, did stuff like that over the European armies, which is just like a remarkable thing to pull off culturally. And there's a great story and you can't quite verify that it's true, but I believe it's true. So Napoleon hated Toussaint and wanted to get him and he in fact assigned his brother-in-law to kind of run the operation in Haiti because he was just so furious about it. And one of the things that he said and remember Toussaint, Louverture, slaves didn't have last names. So like where did Louverture come from? You know, he was born Toussaint, like where did the last name come from? And the story goes, Napoleon's yelling at his generals. He's going, how in the hell can you not defeat this slave? And one of the generals says, look, we back him up. We have him cornered. And just when we think we're going to get him, there's an opening. So he became Toussaint, Louverture, Toussaint the opening. I think that, you know, that's a product of the culture. Like he could always get away because he had so much support because, you know, he was culture first. He wasn't, we're going to win and be as destructive as these guys were to us. We're going to win and be a different kind of army. We're going to be the kind that you can trust. And, you know, that had all kinds of side effects. So it shows you the power. Not only can you change culture, but how powerful it is when you do so. When we look at these potential investments, you know, we debate competitive advantage. We debate modes, you know, is data a mode, is technology a mode, et cetera, et cetera. Is culture a mode? Is it like the ultimate mode to be competitors? Yeah. So I think in a business context, if you build a culture that doesn't create competitive advantage, it's kind of a little bit of a waste. Right. Because, look, cultural ideas aren't for every company. Like different companies have different cultural ideas. And I'll give you an example. So Amazon is like very famous for being cheap. You know, like frugality is a big thing there. And in fact, in the old days, instead of giving you like a desk from wherever Ikea, they'd give you like an old door that they got, you know, on two by fours to just show you like we're cheap. We don't waste any money. That's what it is. And that was a great idea for them because their whole thing was we're going to be the low price leader. That was the beginning of kind of the first competitive advantage. And you need everybody in the company to be of that culture. Now you look at Apple, their Cupertino campus, they have like five thousand dollar doorknobs and stuff like that. Like they're the opposite of cheap. But they never want it to be cheap, you know, because they're high design. Like that's their competitive advantage. So they have a culture that facilitates that. And I think, you know, cultural competitive advantage and like you work at Andreessen Horowitz, we do a lot of things. And there's a whole story behind what we do and why we do it and the way we do it and all this kind of thing. Culture is not like come from a person. The whole place has to kind of agree, believe in it because there's no way I don't see every I'm not in every meeting. Like how am I going to enforce a culture? And I rarely do it anymore because everybody else does it. Like we had an incident where like somebody said like some entrepreneur or company had like an obvious like security bug that they screwed up on. And one person in the firm who was new wrote a tweet like that was an obvious mistake. And 30 people get them in the Slack channel. It's like you got to take that tweet down. We don't criticize entrepreneurs in their like moment of weakness. We don't do that. Like what are you talking about? I didn't say anything. So that it kind of is, you know, what is the place about? It's the most team thing that you have. Yeah. So let's switch gears a little bit if we could. We're very fortunate here that we have pretty much the entire cross section of the health care and, you know, biotech or life sciences industry. We've got the payers, providers, we have regulators, we have again biotech companies and the like. To me, one of the most interesting cross sections that we have in this room is we have startups and we have incumbents. And, you know, for me, having been in this industry for a long time, the interplay between startups and incumbents is one of the most fascinating things about the health care industry. Because on the one hand, our partner Alex Rontel has this great quote that, you know, I'm going to screw it up, but it's like the battle between startups and incumbents is can the startups get distribution before the incumbents get innovation? Yeah. Right. In the health care industry, what's interesting is, you know, when you're competing, that's true. In many cases, startups and incumbents have to collaborate, right? Because the health care system is so complex. And so when you're competing, it's can I get to distribution as a startup before the incumbent gets to innovation? But when you're collaborating, you're actually renting from each other, right? The startup is renting expertise, they're renting access, they're renting, you know, the ability to get to patients. And the incumbent, in many cases, is renting innovation. Right. So it's not a battle. Yeah. So I would say, you know, the big thing that's really different about bio and health care from kind of regular tech is both distribution and innovation are dramatically more difficult in bio than they are in other fields. Distribution is just so much radically harder. It's, I want to say 50 times harder, just because, look, you've got so many, you've got regulators, and you've got like a very complex health care system with everything. You've got hospitals, you've got doctors, you've got patients. And to navigate through that before you run out of cash as a startup, like it's really difficult to raise enough money to do that with no help. And then on the other end, you know, innovation is very difficult because you build an organization to do drugs in a certain way, and then all of a sudden, oh, you've got AI, you've got CRISPR, you've got gene therapy. Well, none of your processes are built around that. And so like either you're going to do some like very radical surgery on your big company, or you're going to go learn how to do that from somebody. It is very, very different in that way, and it's unlike any other kind of field that we plan. Yeah, no, I think that's right. We started this conversation with you giving us the history lesson on the birth of the Internet and how it could have been the information superhighway with tolls on it and all that. A big theme of this meeting has been AI. Yeah. And we've talked about that. How do you read this moment for AI and how would you advise founders to think about how to navigate what is an incredibly rapidly evolving terrain? Yeah, so it's really been fascinating. I actually studied AI in graduate school. That was my focus. And the one part of AI we knew wasn't going to work was neural networks. Because in those days, you know, you'd make one to do like OCR, you know, character recognition, and it could recognize like the letter A and the letter Q and nothing else. It was kind of the irony of AI was it was like this general purpose thing that could only do the most specific thing you could imagine. So it's really been like startling. You know, kind of started in 2012, but really kind of picked up in the last, well, you know, massively since chat GPT was released. So I think that the main thing is when there's this big a change that's so fundamental, you have to run at it. Like, do not think you know what it is. Don't try and get a quick assessment and go, well, it's good for this and not that. Or, well, it's good for their business, but not our business. Or it's going to like top out because we're out of data or whatever. Don't jump to a quick conclusion on it. You have to get far into the details to really kind of understand its implications. And what I always find on these things is closer and the more you understand it, what you'll find is most people are doing the thing I said not to do. And so it can very quickly become a, you know, what looks like a existential threat to you maybe will quickly become a massive competitive advantage if you understand it and master it. But like the most dangerous thing is to ignore it, dismiss it or kind of give it short treatment. Great. We're nearing the end of our time. So I'll ask you two things to close this out. One is you're approaching the 10 year anniversary of the publication of Hard Thing About Hard Things. Yes, I am. Yeah. So if you were to write an epilogue for the 10th anniversary edition for that book, anything you would say? Well, I think I wrote it. What you do is who you are. Fair enough. That was the big missing part I thought of the Hard Thing About Hard Things. You know, and part of it, it's just like the advanced version. Like culture really starts to matter at scale because, you know, like you don't have anybody's run anything at scale. You don't actually any longer have command and control of the company. Right. You know, Vinita is smarter than me. I can't tell her what to do. Right. Like there needs to be like we need to be part of the kind of same idea. And so like the first book was for kind of any entrepreneur. I think that for the second book was more relevant for people who got to some scale. Fantastic. Well, in the first book, you started every chapter with a rap quote. Can you close us out with a quote in your mind that, you know, gives us some stage or wisdom, captures the moment? Yes. I always considered like a founder quote, the most founder quote from Rakim, who is maybe the first or one of the kind of first truly kind of great rappers who turned it into kind of like a party music to an art form. And his line was, you're just a runner rapper. Your rhymes are minute made. I'll be here when it fades and watch you flip like a renegade. And he was basically anticipating it's like all you guys jumped into rap because it's hot now. But like, as soon as things go bad, I'll watch you go run to something else. You know, but I'm the real guy. And I think that this is a kind of a time we're seeing like founders kind of run away. It's like, oh my God, I was doing this to get rich. Now I'm going to leave and only the ones who are building something important are going to stay in a time like this. So listen to Rakim. And it was a song called Follow the Leader, which is also a great leadership song, one of the all time great leadership songs. Thank you, Ben. Thank you for joining us. Thank you for coming. If you like this episode, if you made it this far, help us grow the show. Share with a friend. Or if you're feeling really ambitious, you can leave us a review at rate this podcast dot com slash a 16 C. You know, candidly, producing a podcast can sometimes feel like you're just talking into a void. And so if you did like this episode, if you liked any of our episodes, please let us know. We'll see you next time."}, "podcast_summary": "In this episode, Ben Horowitz discusses the importance of individual efforts in shaping the world and the role of founders in driving change. He shares insights on the wartime and peacetime CEO mindset, and emphasizes the importance of culture, which he defines as a set of actions rather than beliefs. He highlights the difficulty of scaling culture and the need for consistent daily reminders to maintain it. Ben also touches on the dynamics between startups and incumbents in the healthcare industry, and the challenges and opportunities brought by AI. He concludes with a quote from Rakim, urging founders to stay committed and focused on building something important.", "podcast_guest": {"name": "Ben Horowitz", "summary": "Cannot get guest organization...Cannot get guest title..."}, "podcast_highlights": "The guest in this podcast transcript brings up a few controversial and out-of-the-box insights. Here are the key points:\n\n1. Culture is not a set of beliefs, but a set of actions. This challenges the idea that culture is strictly based on a set of shared values or beliefs. Instead, it emphasizes the importance of behaviors and how people treat each other.\n\n2. Being a wartime CEO means making tough decisions and being willing to be inconsistent. The guest talks about how during times of crisis or rapid change, leaders need to be decisive and make tough choices, even if it goes against previous plans or beliefs.\n\n3. The guest discusses the importance of cultural assimilation in organizations, especially when scaling. Bringing in new employees from different backgrounds or cultures can be a challenge, and ensuring everyone aligns with the company's culture is crucial.\n\n4. The guest also highlights the difficulty of navigating the healthcare industry, particularly in terms of distribution and innovation. Startups and incumbents often have to collaborate because of the complexity of the healthcare system. However, the guest advises startups to run towards AI and not dismiss it or underestimate its potential impact.\n\nOverall, the guest's insights challenge conventional thinking and provide a different perspective on topics such as culture, leadership, and industry dynamics."}