{"podcast_details": {"podcast_title": "Science with Sabine", "episode_title": "I do my own research. And so can you.", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/staging/podcast_uploaded_nologo/38479165/38479165-1690172491352-4f0484344d058.jpg", "episode_transcript": " I've noticed that a lot of scientists on social media make jokes about people who do their own research. This has been going on ever since Covid and it's only been getting worse. We're now at the point where they're claiming you're only allowed to talk about a topic you're an expert in yourself. Don't you dare comment on anything you don't have a PhD in. I think this nonsense has been going on for long enough, so I'm here to say, it's of course completely okay if you do your own research, provided you do it right. But how do you do that? That's what we'll talk about today. This video is not a guide for writing a PhD thesis, setting up a placebo-controlled drug trial or building a particle collider. I'm not talking about how to do a scientific research project. I'm talking about how to research resources that you can for the most part find online. It's this context in which the phrase doing your own research has become common. As with most problems on social media, the idea that you shouldn't talk about topics you don't have a degree in started from a good place and then went horribly wrong. It began in the early days of the Covid pandemic when few people knew what was going on, but they were difficult to hear amidst the noise of non-experts who generously handed out uninformed opinions. People who did their own research became a running joke for good reasons and quite a few of them ended up on emergency wards. Unfortunately, the joke continued after the reasons were gone. And so here we are today where you're not allowed to quote from governmental reports on, say, gender-affirming care, because that counts as doing your own research. And yes, I'm talking about this because it personally affects me. I frequently get people complaining, both here and on other social media, that I'm talking about topics I'm not an expert in. Marijuana, climate change, obesity, bees, AI, neurodiversity. I don't know much about any of those, or at least I didn't until I had to figure out how to pronounce tetrahydrocannabinol. Yet that hasn't stopped me. Some people really, really don't like that. You've probably seen them in the comments here saying I should stick to physics. Indeed, why doesn't Sabina stick to physics? I talk about other topics not because I like to annoy people. Though now that I think about it, that's definitely a bonus. But mostly it's because I like to be well informed about what's going on in science, engineering and technology, broadly speaking, not just my own niche in physics. And I found it difficult to find good information that's a, comprehensible, b, doesn't dumb things down, is c, politically neutral, and d, brief. So I decided to do it myself. And unlikely as that might have seemed three years ago, I'm now the owner of a science news business. When I talk on this channel, I don't talk as a physicist, I talk as a science communicator with 20 years experience backed up by a team of scriptwriters and fact checkers. Of course I talk about topics I'm not an expert in myself. Do you think the guy on the evening news is an expert on child soldiers in Congo? But I found it difficult to find people to work for me who are good at doing their own research. And so I was thinking I'll do a video and explain how to do it. Before we talk about doing your own research, let's talk about when not to do it. That's when there's nothing to research, when there's no information online, other than that coming from people who know more than you do. The early days of the COVID pandemic were an example of that. If you didn't know your way around with virology and epidemiology, you couldn't make sense of the little data that were available. Another case may be when information is classified. Nothing to research, so all you find online is just noise. In such cases, the best thing you can do is shut up and listen to the experts. This is why I don't talk about UFOs. This brings up the question of how to recognize an expert. That's a good question, but it'd lead us somewhat astray. If you're interested in it, let me know and I'll do another video on it. A big part of doing your own research begins before you research anything. Before you start, spend a moment to think about what you can reasonably expect. It takes about 10 years to do a PhD. It takes another 5 to 10 years to get a good overview on a research area. You will not reach the same level of understanding by spending a few hours on Google. No, you won't. You'll have to draw a line somewhere. Usually that's at a point where it just doesn't matter for your purposes. For example, when I was talking about whether to legalize marijuana, I didn't really need to know the biochemical pathways of THC. When I was talking about climate models, I didn't really need to know how to numerically integrate the Navier-Stokes equation. I find that it helps to make a list of concrete questions I want answers to before I even start. That prevents me from going down rabbit holes. Well, sometimes. Besides having reasonable expectations, I also have to constantly remind myself to be honest with myself and acknowledge what I don't understand. I know from past experience that if I start glossing over incomprehensible sentences, that much increases the risk that I make mistakes. A good example is the blunder in my video on the greenhouse effect, where I said that the gravitational force decreases with altitude and that's why the air density decreases. Now, it's right that the gravitational force decreases with altitude and it's right that the air density also decreases with altitude, but the former isn't the reason for the latter. Obviously not. If you think about it for more than a millisecond, that doesn't make any sense. The density would decrease even if the force didn't depend on the altitude. And why did I get this wrong? Because the combination of words sounded kind of plausible and I didn't think about it. I left the video up the way it is, because it doesn't matter for anything else I said there, but I'm still embarrassed about it. Another example is the story about how the core of Earth supposedly started spinning in the other direction. Remember that? Someone from my team put this into the script that I was supposed to read. I couldn't see how that was possible. Where did all that angular momentum go? How could the core suddenly start going the other way when it's coupled to the mantle through a liquid layer in between? Just like that? Wouldn't you at least expect a very good explanation for how this can possibly happen? I didn't understand what my script writer had written, so I had a close look at the paper. And sure enough, it turned out that the paper wasn't about the absolute rotation of the core, but the rotation relative to that of the mantle. The core of Earth used to spin a little bit faster than the mantle, now it seems to spin a little bit slower. And yes, that actually does have a tiny effect on the length of the day. Suddenly it all made sense. Now I understood it. Why did I not just read what my script writer had written and make the same mistake as many others? Because I didn't understand it and I didn't want to say something I didn't understand. So when you do your own research, keep track of what you do and don't understand. Something else to get out of the way before you start is acknowledging your own biases. If you're doing research on a topic that you've previously put forward strong opinions about, you might be reluctant to admit that you were wrong. The best way I find to deal with this is to remind myself that admitting to being wrong is the hallmark of a good scientist. Yeah, I still don't like it, but it does help a little. I find it difficult especially with topics that I have worked on myself, such as specific dark matter models. Another factor that can bring in bias is if you or someone you know is personally affected. Suppose you had an expensive and painful procedure that a doctor said would help you, but new research finds that this intervention doesn't have any clear benefits. You're likely to insist that it worked for you anyway because that makes a good psychological protection. And that's fine if it's just your personal way of dealing with it. Not so fine if you tell others the study is wrong because you don't like the result. So we have reasonable expectations, honesty with yourself, acknowledging biases and that puts us in a good position to start with the actual research. I suggest you start your research by looking for peer-reviewed review articles, governmental reports, lecture notes and textbooks. Then you read them. Yes, this is going to take some time. No one said it would be easy, but you don't have to read all of this in great detail. Those sources usually begin with an overview and most of the details that follow later won't be so important for you. The important thing to take away is what the key questions are that you need to pay attention to. A review article is basically an overview on the status of research and some scientific journals specialize in them. The Nature Group publishes a lot of them and if you can find one on the topic you're interested in, that's usually pure gold. You find governmental reports either on the governmental websites or that of the Ministry of Science and Education or whatever it's called in your country. Other good resources are specialized national institutions such as the National Academy of Sciences in the USA or the Fraunhofer Institute in Germany. After you know what you need to pay attention to, you can move on to meta-reviews if they exist in the field you're looking at. A meta-review is a summary of previous research studies. Meta-reviews can be great and save you a lot of work but enjoy them with some caution. A summary of crappy studies does not make a good study. You should only trust meta-reviews if they assess the quality of the studies they summarize and not just lump together different data. And after that you can move on to the most recent studies. Then you should have a pretty good impression of what's going on in the field and be well prepared to put new stuff into context. Okay, now let's talk a bit about how to search for scientific literature and how to understand what you're looking at. First of all, if you're searching for scientific literature, I suggest you don't use Google's main interface but you use Google Scholar. Indeed, in many cases, Google will suggest that you switch to Scholar. Google Scholar shows you quickly whether a paper has been published in a scientific journal and it has an extremely useful feature, which is that it lets you search for articles that have referred to an earlier article. This is great if you have a fairly old reference and you want to know what's happened recently. All you have to do is search for all papers that have cited the old one and sort them by date. I did this a lot when I was working on the video on collective intelligence. That's because the only thing I knew about the topic were some of the classical studies in the field and looking for recent papers that cite the classics is a good way to find reviews. Next thing you need to do is figure out whether an article has been peer reviewed. At present, almost all peer review is done at submission to a scientific journal. If the paper passes peer review, it'll be a very good way to find out what's been done. If it passes peer review, it'll be accepted for publication. So you have to check whether the paper has a journal reference and if it's a decent journal. It can be difficult to figure out what's with the journal, but if you don't know the journal, at the very least check if it's on the list of predatory journals, because such journals will basically publish anything for money. Also make sure that what you're looking at is not a pre-print server. Pre-print servers should really be called pre-peer review servers. It's where scientists upload papers before they submit them to a journal. You should stay away from pre-prints unless you can consult an expert. The most widely used pre-print servers are the archive in physics and related disciplines and the bio archive in the life sciences, though there are a few others. Also be very careful with reports or surveys from non-profit organizations or corporations, because these are rarely peer reviewed. It's not that they're necessarily wrong, but that they often don't disclose how they arrived at their results and there's a risk they have omitted relevant information. Conference proceedings can be difficult to understand because their purpose strongly depends on the field. In some areas like particle physics, conference proceedings are where you dump preliminary results or summaries of your own work that wouldn't get published in a journal anyway. Not because they're wrong, but because they're not new or not interesting enough. In other fields like engineering or computer science, conference proceedings are the final product. They do their research, present it at a conference, write it up and publish it in the proceedings and that's that. They're usually peer reviewed, or at least they're supposed to be, so don't dismiss conference proceedings. In some fields, they're vital. Let's then talk about some things you should not do. The number one mistake that I see among people who do their own research is that they just pick one or two papers that kind of say what they want to say and leave it at that. This is not how research works. The second most important don't is to never trust a second hand reference. Don't trust websites referring to other websites, press releases referring to papers, newspapers referring to reports or magazines quoting scientists. Don't trust books referring to other books, don't trust Wikipedia and don't trust people talking on YouTube. You have to track every piece of information down to its source and then check how reliable that source is. That's not to say that second hand references are useless. They are pretty good for pointing you into the right direction. Wikipedia in particular is a good starting point to launch into the scientific literature. Just don't make it the end point. My final advice for today is that if there's data, look at the data. Don't trust the text. I see this all the time that data in a paper don't support what the abstract or the conclusion says. For this you'll have to know what p-values and r-coefficients are and stuff like that and that would make for another video entirely. So for today, let me just say that while outright scientific fraud is rare, it happens all the time that written text is sloppy or doesn't properly represent the data. Okay, in summary. Before you set out to do your own research, clarify for yourself which questions you're trying to answer and if you have a reasonable chance of answering them in the first place. Acknowledge the limits of your understanding and possible biases. Once you've done that, start with the basics and try to get an overview by help of reviews and reports, then work your way up to more recent publications. Don't cherry pick studies, don't trust text if there's data, don't trust second hand sources and don't trust me either. Thanks for listening, we'll be back next week."}, "podcast_summary": "Dear students and followers, let us delve into the world of scientific research and the notion of doing your own research. In recent times, social media has witnessed scientists mocking individuals who attempt to conduct their own research. This trend, which began during the Covid-19 pandemic, has escalated to the point where people are being discouraged from commenting on topics outside their area of expertise. However, I am here to tell you that it is perfectly acceptable to do your own research, as long as it is done correctly. So, how can we ensure that we carry out effective research?\n\nFirst and foremost, let's clarify what we mean by \"doing your own research.\" In this context, it refers to researching resources that are predominantly available online, rather than undertaking scientific research projects like writing a Ph.D. thesis or conducting drug trials. The phrase gained popularity due to the chaotic influx of opinions from non-experts during the early days of the Covid-19 pandemic. People who conducted their own research without appropriate knowledge or understanding ended up in emergency wards, leading to them becoming the subjects of jokes. Unfortunately, this jest continued even after the initial reasons had passed.\n\nNowadays, a strict rule has emerged that dictates one can only discuss topics they possess a Ph.D. in, and this has affected me personally. I frequently receive complaints on social media about discussing subjects outside my expertise, such as marijuana, climate change, obesity, bees, AI, and neurodiversity. However, I choose to talk about these topics not to irritate people (although it may be a bonus), but because I want to be well-informed about a wide array of scientific, engineering, and technological matters. It has been challenging to find comprehensive, non-biased, and concise information on these topics, so I decided to create a science news platform to fill that gap.\n\nBefore delving into the intricacies of doing your own research, let's establish the situations in which it is not advisable. For instance, during the early stages of a pandemic or when information is classified, it is best to rely on experts and refrain from pursuing personal research. In these cases, there might be limited data and understanding, leaving non-experts incapable of making sense of the available information. It is crucial to know when to step back and trust the expertise of those who possess the necessary knowledge.\n\nNow, let's discuss how to recognize an expert, but that deserves a separate video in itself. Moving on, before embarking on any research, it is essential to set reasonable expectations. Acquiring a Ph.D. usually takes around 10 years, while gaining a comprehensive overview of a research area may require an additional 5 to 10 years. It is unrealistic to expect the same level of understanding from a few hours of internet research. Therefore, it is wise to draw a line and focus on the aspects relevant to your goals. Create a list of concrete questions you need to answer, which will help you stay focused and avoid distractions.\n\nAnother critical aspect of research is being honest with yourself and acknowledging what you do not understand. Glossing over incomprehensible sentences increases the likelihood of making mistakes. In my own experiences, I have made blunders due to this very reason. It is vital to take the time and effort to grasp complex concepts and not rely on plausible-sounding phrases that lack logical coherence. Be critical and strive for a clear understanding.\n\nFurthermore, be aware of personal biases that might affect your research. If you have previously expressed strong opinions on a topic, it can be challenging to admit that you were wrong. Nevertheless, one must remember that admitting mistakes is a hallmark of a good scientist. Personal biases, especially when one is personally affected, can cloud judgment and lead to disregarding evidence contradicting one's beliefs. It is important to distinguish personal coping mechanisms from providing accurate information to others.\n\nNow, let's address the methodology of research. Start by searching for peer-reviewed review articles, governmental reports, lecture notes, and textbooks. These sources serve as a foundation, offering overviews and identifying key questions to explore. Review articles, especially those published in respected journals like Nature, are invaluable resources. Governmental reports and specialized institutions, such as the National Academy of Sciences, are also reliable sources of information. Once you have a grasp of the field, move on to meta-reviews, which summarize previous research studies. However, exercise caution and ensure that the meta-review properly assesses the quality of the studies rather than lumping together various data.\n\nTo dive deeper, explore recent studies to gain a comprehensive understanding and put new findings into context. When searching for scientific literature, use Google Scholar instead of the main Google interface. Google Scholar allows you to quickly determine if a paper has been published in a scientific journal and even search for articles that have referenced earlier works. This feature aids in discovering recent developments in a specific field. While exploring papers, it is crucial to verify if they have undergone peer review and check the reliability of the journal in which they are published. Be wary of predatory journals and exercise caution with non-peer-reviewed reports, surveys, and pre-print servers.\n\nFinally, it is important to avoid common mistakes. Do not cherry-pick studies that align with your preconceived notions, as this goes against the impartial nature of research. Additionally, do not solely rely on secondhand references, such as websites, press releases, or media reports. Always trace information back to its primary source and critically evaluate its reliability. When information is available, prioritize analyzing the data itself instead of relying solely on text interpretations. Mistakes or misrepresentations often occur in written explanations, making it essential to scrutinize the provided data.\n\nIn summary, before you embark on your own research, establish clear objectives, manage your expectations, acknowledge your limitations, and address personal biases. Begin with foundational resources, such as review articles and reports, and gradually delve into more recent studies. Avoid cherry-picking, rely on primary sources, and scrutinize data rather than relying solely on interpretation. Remember, doing your own research is an endeavor that requires dedication, critical thinking, and constant self-awareness.\n\nThank you for joining me today, and I look forward to our next exploration together.", "podcast_guest": {"name": "Sabine Hossenfelder", "summary": "Cannot get guest organization...Cannot get guest title..."}, "podcast_highlights": "The guest in this podcast transcript offers a controversial and out-of-the-box insight about the idea of \"doing your own research\" and the restrictions imposed by experts.\n\n1. The guest challenges the idea that only experts can talk about certain topics, emphasizing that it's okay for individuals to do their own research, as long as they do it correctly.\n\n2. The guest criticizes the mocking attitude of some scientists on social media towards people who do their own research, pointing out that this attitude arose during the early days of the COVID-19 pandemic when misinformation was spreading rapidly.\n\n3. The guest highlights the difficulty of finding reliable, comprehensive, politically neutral, and concise information online. This led them to start their own science news business to provide well-informed content on various scientific topics.\n\n4. The guest emphasizes the importance of understanding what you don't know and being honest with yourself throughout the research process. They admit to making mistakes themselves and emphasize the need to correct and learn from them.\n\n5. The guest provides tips on how to research effectively, including starting with peer-reviewed review articles, governmental reports, lecture notes, and textbooks. They also discuss the importance of recognizing biases and acknowledging personal limitations.\n\n6. The guest advises using Google Scholar for scientific literature searches and warns against relying on second-hand references or incomplete information. They encourage examining the data instead of blindly trusting the written text.\n\n7. The guest concludes by summarizing the key points: clarifying research questions, knowing the limits of understanding, starting with good overviews, being cautious with sources, and critically analyzing data.\n\nOverall, the guest's insights challenge the notion that only experts should discuss certain topics and provide practical advice for conducting thorough and unbiased research."}